{
  "_name_or_path": "Rostlab/prot_bert_bfd",
  "adapters": {
    "adapters": {
      "AdapterBERT_adapter": "pfeiffer"
    },
    "config_map": {},
    "fusion_config_map": {},
    "fusions": {}
  },
  "architectures": [
    "BertAdapterModel"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 40000,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 30,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "prediction_heads": {
    "AdapterBERT_head_adapter": {
      "activation_function": "relu",
      "bias": true,
      "dropout": 0.3,
      "head_type": "classification",
      "label2id": {
        "LABEL_0": 0
      },
      "layers": 2,
      "num_labels": 1,
      "use_pooler": false
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30
}
